#include <stdio.h>
#include <iostream>
#include <locale.h>
#include <windows.h>

using namespace std;

void main()
{
	setlocale(LC_ALL, "Rus");
	unsigned short int otv;
	cout << "Хотите стать профессиональным музыкантом? 1-Да, 2-Нет \n";
	cin >> otv;
	if (otv == 1)
	{
		cout << "Вы богаты?. 1-Да, 2-Нет \n";
		cin >> otv;
		if (otv == 1)
		{
			otr:
			cout << "Любите отрываться?. 1-Да, 2-Нет \n";
			cin >> otv;
			if (otv == 1)
			{
				cout << "Пиво пьете?. 1-Да, 2-Нет \n";
				cin >> otv;
				if (otv == 1)
				{
					cout << "Хотите играть классику?. 1-Да, 2-Нет, 3-Незнаю \n";
					cin >> otv;
					if (otv == 1)
					{
						cout << "Готовы работать круглые сутки?. 1-Да, 2-Нет \n";
						cin >> otv;
						if (otv == 1)
						{
							cout << "Ваш инструмент: Гобой \n";
						}
						else
						{
							cout << "Готовы к тому, что будут проблемы с работой, даже если вы круто играете?. 1-Да, 2-Нет \n";
							cin >> otv;
							if (otv == 1)
							{
								cout << "Ваш инструмент: Кларнет \n";
							}
							else
							{
								cout << "Ваш инструмент: Валторна \n";
							}
						}
					}
					else if (otv == 3)
					{
						cout << "Ваш инструмент: Тромбон \n";
					}
					else
					{
						cout << "... a джаз?. 1-Да, 2-Нет \n";
						cin >> otv;
						if (otv == 1)
						{
							cout << "Ваш инструмент: Саксофон \n";
						}
						else
						{
							cout << "У вас есть немецкие корни?. 1-Да, 2-Нет \n";
							cin >> otv;
							if (otv == 1)
							{
								cout << "Ваш инструмент: Труба \n";
							}
							else
							{
								cout << "Ваш инструмент: Дудук \n";
							}
						}
					}
				}
				else
				{
					cout << "Вы страстная натура?. 1-Да, 2-Нет \n";
					cin >> otv;
					if (otv == 1)
					{
						cout << "Ваш инструмент: Виолончель \n";
					}
					else
					{
						cout << "Ваш инструмент: Домбра \n";
					}
				}
			}
			else
			{
				cout << "Готовы заниматься по 8 часов в день?. 1-Да, 2-Нет \n";
				cin >> otv;
				if (otv == 1)
				{
					cout << "Хотите учить детей?. 1-Да, 2-Нет \n";
					cin >> otv;
					if (otv == 1)
					{
						cout << "Ваш инструмент: Флейта \n";
					}
					else
					{
						cout << "Ваш инструмент: Скрипка \n";
					}
				}
				else
				{
					cout << "Ноты знаете?. 1-Да, 2-Нет \n";
					cin >> otv;
					if (otv == 1)
					{
						cout << "Ваш инструмент: Арфа \n";
					}
					else
					{
						cout << "Ваш инструмент: Альт \n";
					}
				}
			}
		}
		else
		{
			cout << "Любите деньги?. 1-Да, 2-Нет \n";
			cin >> otv;
			if (otv == 1)
			{
				cout << "ЗАБУДЬТЕ О МУЗЫКЕ \n";
			}
			else
			{
				goto otr;
			}
		}
	}
	else
	{
		cout << "Хотите встречаться с девушками?. 1-Да, 2-Нет \n";
		cin >> otv;
		if (otv == 1)
		{
			cout << "Любите глупышек?. 1-Да, 2-Нет \n";
			cin >> otv;
			if (otv == 1)
			{
				cout << "Любите выпить?. 1-Да, 2-Нет \n";
				cin >> otv;
				if (otv == 1)
				{
					cout << "Ваш инструмент: Гитара \n";
				}
				else
				{
					cout << "Ваш инструмент: Фортепьяно \n";
				}
			}
			else
			{
				par:
				cout << "Вы парень?. 1-Да, 2-Нет \n";
				cin >> otv;
				if (otv == 1)
				{
					cout << "Оперный певец \n";
				}
				else
				{
					cout << "Ваш инструмент: Ударные \n";
				}
			}
		}
		else
		{
			cout << "Хотите встречатся с парнями?. 1-Да, 2-Нет \n";
			cin >> otv;
			if (otv == 1)
			{
				goto par;
			}
			else
			{
				cout << "Ваш инструмент: Фагот \n";
			}
		}
	}
}